{"html_attributions":[],"result":{"formatted_phone_number":"020 8449 5466","geometry":{"location":{"lat":51.6450926,"lng":-0.1646265},"viewport":{"northeast":{"lat":51.6465207802915,"lng":-0.163198919708498},"southwest":{"lat":51.6438228197085,"lng":-0.165896880291502}}},"name":"Brookhill Nursery School","opening_hours":{"open_now":false,"periods":[{"close":{"day":1,"time":"1800"},"open":{"day":1,"time":"0800"}},{"close":{"day":2,"time":"1800"},"open":{"day":2,"time":"0800"}},{"close":{"day":3,"time":"1800"},"open":{"day":3,"time":"0800"}},{"close":{"day":4,"time":"1800"},"open":{"day":4,"time":"0800"}},{"close":{"day":5,"time":"1800"},"open":{"day":5,"time":"0800"}}],"weekday_text":["Monday: 8:00 AM – 6:00 PM","Tuesday: 8:00 AM – 6:00 PM","Wednesday: 8:00 AM – 6:00 PM","Thursday: 8:00 AM – 6:00 PM","Friday: 8:00 AM – 6:00 PM","Saturday: Closed","Sunday: Closed"]},"rating":4,"reviews":[{"author_name":"Vic L","author_url":"https://www.google.com/maps/contrib/105426623946157370908/reviews","language":"en","original_language":"en","profile_photo_url":"https://lh3.googleusercontent.com/a-/ALV-UjXvARD-8ASQ0JCnMcwFEhUhxpRCRfvsFasDNXaZG4b-qSk=s128-c0x00000000-cc-rp-mo","rating":5,"relative_time_description":"4 months ago","text":"I would like to extend my heartfelt congratulations on achieving an outstanding  rating from Ofsted. It is truly well-deserved, as Brookhill Nursery has consistently proven itself to be a remarkable institution. I have always held a deep affection for this nursery and its exceptional staff. Not only did my eldest twins attend, who are now 9 years old, but now my second set of twins, aged 3, are also experiencing the same wonderful environment. I am sincerely grateful to all of you for creating a place where our children's lives are brimming with joy and excitement every single day, akin to a perpetual funfair.\n\nBrookhill Nursery is an amazing place that allows children to freely express themselves without being confined by strict boundaries. It fosters an understanding of their own power as little human beings, empowering them to embrace their unique qualities as well as develop their skills with others.\n\nThe dedication and attentiveness of the teachers are truly commendable. They provide invaluable support, particularly with regard to potty training. I can personally attest to their assistance, as they have helped me navigate through the challenges of potty training all four of my children.\n\nThe unwavering support of the parents within the Brookhill community is truly remarkable. It is heartening to witness the collective effort put forth by both the nursery staff and parents to create an enriching environment for our children. Together, we form a strong and nurturing partnership, ensuring the best possible experience for our little ones.\n\nOnce again, I would like to express my deepest gratitude to everyone at Brookhill Nursery for their unwavering commitment to providing an exceptional early childhood education. I eagerly look forward to September, knowing that my children will continue to thrive in the nurturing and stimulating environment that you have created.\n\nThanks so much!","time":1689134989,"translated":false},{"author_name":"HKMJ G","author_url":"https://www.google.com/maps/contrib/111892699610119666550/reviews","language":"en","original_language":"en","profile_photo_url":"https://lh3.googleusercontent.com/a-/ALV-UjUf0e79-qwRGsMPpxR6VSB_xCCONNpBhKfmGkFuEjd-Qi0H=s128-c0x00000000-cc-rp-mo","rating":5,"relative_time_description":"4 months ago","text":"Brookhill Nursery is exceptional! My daughter had a fantastic time there, thanks to the friendly staff and nurturing environment. Highly recommended!","time":1690010039,"translated":false},{"author_name":"Laura Stevenson","author_url":"https://www.google.com/maps/contrib/113234651879333821781/reviews","language":"en","original_language":"en","profile_photo_url":"https://lh3.googleusercontent.com/a/ACg8ocKLlUtqjQGxnEt5xEQ5PIzUAP5Obl1PBxr6kfKGyTyX=s128-c0x00000000-cc-rp-mo","rating":5,"relative_time_description":"4 months ago","text":"My daughter loved this nursery and was sad to have to say goodbye after 2 fantastic years. A special thanks to her key worker Georgia, I'm forever grateful.","time":1690398282,"translated":false},{"author_name":"My Travel Atelier","author_url":"https://www.google.com/maps/contrib/104400944029480175917/reviews","language":"en","original_language":"en","profile_photo_url":"https://lh3.googleusercontent.com/a-/ALV-UjWx4mp2biYEUVtwfvsW5lqUjfUBkwLGGr2SIHoYs8lHiIM=s128-c0x00000000-cc-rp-mo","rating":1,"relative_time_description":"9 months ago","text":"I wouldn't recomend this place no one. Staff members banishes kids on the garden even outside is -6 during the winter.\n\nMost children run a runny nose, some children eat what comes\nout of their nose.\n\nchildren only go there and do what they want and consequently they get bored and beat (it's normal for the staff).\nThey don't learn anything there, they don't have routines.\n\nStaff members don't control children at all.","time":1676978483,"translated":false},{"author_name":"David Alexander","author_url":"https://www.google.com/maps/contrib/115620113403548326476/reviews","language":"en","original_language":"en","profile_photo_url":"https://lh3.googleusercontent.com/a-/ALV-UjU0VtpyzDxNkn9G8RRk-TZEdejZUMLaFMw1c5bst0lsdvx5=s128-c0x00000000-cc-rp-mo-ba3","rating":5,"relative_time_description":"11 years ago","text":"I don't know what could have prompted another reviewer to rate this nursery 'poor - fair'! Better look at the last Ofsted report available online which gives a much fairer assessment of this brilliant nursery.\n\nI was lucky enough to spend a whole day at this state nursery recently and find it really excellent. It has a high proportion of qualified teachers - more so than a private (day) nursery will have. Thee grounds are large, and very good use is made of outside space. The facilities are great. Children are able to be outside all day if they wish, and waterproof outerwear and wellies are available. There are a great many different kinds of activities, outdoor and indoor, that the children can engage in to extend their various life skills and knowledge.\n\nThe 3 classrooms are interlinked, allowing children to move quite freely between them. The nursery has good links with parents, and for example has a rota of volunteers coming in to read a story to a class.\n\nBrookhill has a lovely atmosphere, with happy confident children involved in a rich diversity of learning experiences. I would be very happy for my children to go here!","time":1353567857,"translated":false}],"user_ratings_total":11,"website":"https://brookhillnursery.barnet.sch.uk/"},"status":"OK","place_id":"ChIJYfDBRkoYdkgRB9KByqh9svg","address":"Brookhill Rd, London, Barnet EN4 8SD, United Kingdom","categories":["stay and play"]}