{"html_attributions":[],"result":{"geometry":{"location":{"lat":51.49450359999999,"lng":-0.0754735},"viewport":{"northeast":{"lat":51.4957840302915,"lng":-0.07425536970849796},"southwest":{"lat":51.4930860697085,"lng":-0.07695333029150203}}},"name":"Ellen Brown Children Centre","rating":5,"reviews":[{"author_name":"ia DeeDee","author_url":"https://www.google.com/maps/contrib/104299029171672918141/reviews","language":"en","original_language":"en","profile_photo_url":"https://lh3.googleusercontent.com/a/ACg8ocJIFUSEkpEwM0bfHqdvjjqqLIkQnlCW4VpRgxkrUv2B=s128-c0x00000000-cc-rp-mo","rating":5,"relative_time_description":"9 months ago","text":"The Ellen Brown Centre is an invaluable and vital service for babies and new parents, I don't know where I would be without it.\n\nMy son is 9 months old and we have been using the centre since he was 2-3 months. We have gone along to Baby and Me sessions, Boogie Mites and even a baby massage four week course (which I am sure would cost me £100s if I had paid privately!).\n\nEach session is engaging, lots of fun and enjoyable for both babies and parents. Staff explain how activities help your baby reach developmental milestones that will further aid them in the future. The baby massage course my son and I did was comprehensive, yet still easy to understand and follow. We even got a certificate for our participation and a handy guide to take away with us so we can carry on massaging as he grows up.\n\nBoogie Mites is FANTASTIC. Lots of music, rhythmic moving and instruments for your baby to play with. It is also a great workout for parents, as you are encouraged to move your baby to the beat and let yourself go!\n\nMore than just great sessions, what makes Ellen Brown such a wonderful place is the warm and energetic staff. Hope, Katie and Shannon are a source of knowledge and understanding. They clearly love the children they work with and that's what makes you so keen to visit again - knowing your child will be met by someone who truly cares about them and is enthusiastic about their care. They also show the same comforting and personable manner with us parents too.\n\nCentres like Ellen Brown are truly invaluable. I have seen my son come such a long way because he gets the chance to interact and play with other babies. They are also vital to the mental health of new parents, an opportunity to meet other new parents and get out and do something.\n\nI feel so lucky that my baby and I have a centre like this so close to our home.","time":1678380616,"translated":false},{"author_name":"Irene Fung","author_url":"https://www.google.com/maps/contrib/103212559732415227590/reviews","language":"en","original_language":"en","profile_photo_url":"https://lh3.googleusercontent.com/a/ACg8ocJ8w6rAtKK-hy3Z-oe2fJ20bMGqROAdvy4DbhkTvKQY=s128-c0x00000000-cc-rp-mo","rating":5,"relative_time_description":"5 months ago","text":"So much good time spent with my baby here :)","time":1687943756,"translated":false}],"user_ratings_total":2},"status":"OK","place_id":"ChIJ3eSkB2QDdkgREl1MvwDkRog","address":"97-102 Grange Rd, London SE1 3BW, United Kingdom","categories":["adventure playgrounds"]}