{"html_attributions":[],"result":{"geometry":{"location":{"lat":51.4973667,"lng":-0.0696982},"viewport":{"northeast":{"lat":51.4986610802915,"lng":-0.06829926970849796},"southwest":{"lat":51.49596311970851,"lng":-0.07099723029150203}}},"name":"RPCA Soft Play","rating":5,"reviews":[{"author_name":"ia DeeDee","author_url":"https://www.google.com/maps/contrib/104299029171672918141/reviews","language":"en","original_language":"en","profile_photo_url":"https://lh3.googleusercontent.com/a/ACg8ocJIFUSEkpEwM0bfHqdvjjqqLIkQnlCW4VpRgxkrUv2B=s128-c0x00000000-cc-rp-mo","rating":5,"relative_time_description":"4 months ago","text":"We regularly attend Thursday's soft play sessions, with our first visit made when little one was 5 months old.\n\nThe sessions are incredibly fun - the set up is great as the soft play equipment encourages babies and toddlers to move and there are lots of toys that are not only entertaining, but also good for sensory stimulation. My little one is 13 months now, and I really believe that these sessions have helped support physical and social development, particularly with fine and gross motor skills. We do lots of moving every time we come, and we really take advantage of being able to utilise such a huge space to crawl and play. Also keeps me fit too!\n\nEverything is kept incredibly clean, there is also a craft station set up so babies and toddlers can get creative. Nursery rhymes are sung at the end of sessions, which is a sweet way to wind down activities. Staff are friendly, personable and super enthusiastic.\n\nServices like this are vital for the development of babies and toddlers, the sessions being free to access means they are inclusive to everyone in the community. Parents and carers also get the chance to mingle with one another, which I have personally found valuable as a new parent as it helps to be able to talk to others who are sharing similar experiences.","time":1689188659,"translated":false}],"user_ratings_total":1},"status":"OK","place_id":"ChIJuSD2Fv8DdkgR9FAI_OWj6GE","address":"43 Old Jamaica Rd, London SE16 4TE, United Kingdom","categories":["soft play"]}